# YOLOv7 模型配置文件
# 适用于微藻检测任务

# 参数
nc: 80  # 类别数量
depth_multiple: 1.0  # 模型深度倍数
width_multiple: 1.0  # 层通道倍数

# 锚框
anchors:
  - [12,16, 19,36, 40,28]  # P3/8
  - [36,75, 76,55, 72,146]  # P4/16
  - [142,110, 192,243, 459,401]  # P5/32

# YOLOv7 model
model:
  # [from, number, module, args]
  [[-1, 1, Conv, [32, 3, 1]],           # 0
   [-1, 1, Conv, [64, 3, 2]],           # 1-P1/2
   [-1, 1, Conv, [64, 3, 1]],           # 2
   [-1, 1, Conv, [128, 3, 2]],          # 3-P2/4
   [-1, 1, C3, [128, 1]],               # 4
   [-1, 1, Conv, [256, 3, 2]],          # 5-P3/8
   [-1, 1, C3, [256, 1]],               # 6
   [-1, 1, Conv, [512, 3, 2]],          # 7-P4/16
   [-1, 1, C3, [512, 1]],               # 8
   [-1, 1, Conv, [1024, 3, 2]],         # 9-P5/32
   [-1, 1, C3, [1024, 1]],              # 10
   [-1, 1, SPPF, [1024, 5]],            # 11
   # head
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],      # 12
   [[-1, 8], 1, Concat, [1]],                        # 13 (cat backbone P4)
   [-1, 1, C3, [512, 1]],                            # 14
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],       # 15
   [[-1, 6], 1, Concat, [1]],                        # 16 (cat backbone P3)
   [-1, 1, C3, [256, 1]],                            # 17 (P3/8-small)
   [-1, 1, Conv, [256, 3, 2]],                       # 18
   [[-1, 14], 1, Concat, [1]],                       # 19 (cat head P4)
   [-1, 1, C3, [512, 1]],                            # 20 (P4/16-medium)
   [-1, 1, Conv, [512, 3, 2]],                       # 21
   [[-1, 11], 1, Concat, [1]],                       # 22 (cat head P5)
   [-1, 1, C3, [1024, 1]],                           # 23 (P5/32-large)
   [[17, 20, 23], 1, Detect, [nc, anchors]],         # 24 Detect(P3, P4, P5)
  ]
