# parameters
nc: 80  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

# anchors
anchors:
  - [12,16, 19,36, 40,28]  # P3/8
  - [36,75, 76,55, 72,146]  # P4/16
  - [142,110, 192,243, 459,401]  # P5/32

# yolov7 backbone
backbone:
  [GhostNetBackbone,
   [-1, 1, CBAM, [512, 16]],
   ...]

# yolov7 head
head:
  [[-1, 1, SPPCSPC, [512]],
   [-1, 1, DSConv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [37, 1, DSConv, [256, 1, 1]],
   [[-1, -2], 1, Concat, [1]],
   [-1, 1, CBAM, [256, 16]],

   [-1, 1, DSConv, [256, 1, 1]],
   [-2, 1, DSConv, [256, 1, 1]],
   [-1, 1, DSConv, [128, 3, 1]],
   [-1, 1, DSConv, [128, 3, 1]],
   [-1, 1, DSConv, [128, 3, 1]],
   [-1, 1, DSConv, [128, 3, 1]],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
   [-1, 1, DSConv, [256, 1, 1]],

   [-1, 1, DSConv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [24, 1, DSConv, [128, 1, 1]],
   [[-1, -2], 1, Concat, [1]],

   [-1, 1, DSConv, [128, 1, 1]],
   [-2, 1, DSConv, [128, 1, 1]],
   [-1, 1, DSConv, [64, 3, 1]],
   [-1, 1, DSConv, [64, 3, 1]],
   [-1, 1, DSConv, [64, 3, 1]],
   [-1, 1, DSConv, [64, 3, 1]],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
   [-1, 1, DSConv, [128, 1, 1]],

   [-1, 1, MP, []],
   [-1, 1, DSConv, [128, 1, 1]],
   [-3, 1, DSConv, [128, 1, 1]],
   [-1, 1, DSConv, [128, 3, 2]],
   [[-1, -3, 63], 1, Concat, [1]],

   [-1, 1, DSConv, [256, 1, 1]],
   [-2, 1, DSConv, [256, 1, 1]],
   [-1, 1, DSConv, [128, 3, 1]],
   [-1, 1, DSConv, [128, 3, 1]],
   [-1, 1, DSConv, [128, 3, 1]],
   [-1, 1, DSConv, [128, 3, 1]],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
   [-1, 1, DSConv, [256, 1, 1]],

   [-1, 1, MP, []],
   [-1, 1, DSConv, [256, 1, 1]],
   [-3, 1, DSConv, [256, 1, 1]],
   [-1, 1, DSConv, [256, 3, 2]],
   [[-1, -3, 51], 1, Concat, [1]],

   [-1, 1, DSConv, [512, 1, 1]],
   [-2, 1, DSConv, [512, 1, 1]],
   [-1, 1, DSConv, [256, 3, 1]],
   [-1, 1, DSConv, [256, 3, 1]],
   [-1, 1, DSConv, [256, 3, 1]],
   [-1, 1, DSConv, [256, 3, 1]],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
   [-1, 1, DSConv, [512, 1, 1]],

   [75, 1, RepConv, [256, 3, 1]],
   [88, 1, RepConv, [512, 3, 1]],
   [101, 1, RepConv, [1024, 3, 1]],

   [[102,103,104], 1, IDetect, [nc, anchors]],   # Detect(P3, P4, P5)
  ]
